[
  {
    "title": "Pâtes Aglio e Olio (Italie)",
    "ingredients": "200 grammes de spaghettis ou autre type de pâtes,\n4-5 gousses d'ail (finement tranchées),\n4 cuillères à soupe d'huile d'olive,\n1/2 cuillère à café de flocons de piment séché (facultatif),\nsel et poivre noir au goût,\nune petite quantité de persil frais haché (facultatif).",
    "instructions": "1. Faites bouillir les pâtes dans de l'eau salée jusqu'à ce qu'elles soient al dente. Réservez environ 1/2 tasse d'eau de cuisson des pâtes.\n2. Pendant que les pâtes cuisent, faites chauffer l'huile d'olive dans une grande poêle à feu moyen-doux.\n3. Ajoutez l'ail tranché, faites revenir lentement jusqu'à ce qu'il soit parfumé et légèrement doré. Ne le brûlez pas.\n4. Ajoutez les flocons de piment séché (si utilisé), remuez brièvement.\n5. Ajoutez les pâtes égouttées dans la poêle. Mélangez bien avec l'assaisonnement.\n6. Ajoutez un peu d'eau de cuisson des pâtes si c'est trop sec, remuez jusqu'à ce que la sauce enrobe bien les pâtes.\n7. Salez et poivrez. Mélangez bien.\n8. Servez immédiatement avec une pincée de persil haché (si utilisé).",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/main/pasta_aglio_e_olio.jpg"
  },
  {
    "title": "Dal Tadka (Inde)",
    "ingredients": "1 tasse de lentilles jaunes (moong dal ou toor dal),\n1 oignon moyen (finement haché),\n1 tomate moyenne (hachée),\n2 gousses d'ail (hachées),\n2-3 cm de gingembre (râpé ou finement haché),\n1-2 piments verts (facultatif, coupés en deux),\n1/2 cuillère à café de graines de cumin,\n1/4 cuillère à café de poudre de curcuma,\nsel au goût,\n2 cuillères à soupe d'huile végétale ou de ghee,\n2-3 tasses d'eau,\nune pincée de coriandre fraîche (pour la garniture, facultatif).",
    "instructions": "1. Rincez soigneusement les lentilles sous l'eau courante jusqu'à ce que l'eau soit claire. Faites bouillir les lentilles avec 2-3 tasses d'eau et un peu de poudre de curcuma jusqu'à ce qu'elles soient tendres et écrasées. Mettez de côté.\n2. Dans une poêle séparée, faites chauffer l'huile végétale ou le ghee à feu moyen.\n3. Ajoutez les graines de cumin, faites cuire jusqu'à ce qu'elles soient parfumées et crépitent.\n4. Ajoutez l'oignon haché, faites revenir jusqu'à ce qu'il soit translucide et parfumé.\n5. Ajoutez le gingembre et l'ail hachés, faites revenir brièvement jusqu'à ce qu'ils soient parfumés.\n6. Ajoutez la tomate hachée et les piments verts (si utilisés), faites cuire jusqu'à ce que les tomates soient molles et écrasées.\n7. Versez cet assaisonnement sauté dans les lentilles cuites. Mélangez bien.\n8. Faites cuire à nouveau pendant 5-7 minutes pour que l'assaisonnement soit entièrement absorbé. Si c'est trop épais, vous pouvez ajouter un peu d'eau chaude.\n9. Ajustez l'assaisonnement avec du sel. Servez chaud avec du riz blanc ou du pain.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/main/dal_tadka.jpg"
  },
  {
    "title": "Quesadillas au Fromage (Mexique)",
    "ingredients": "2 tortillas de blé de taille moyenne,\n1 tasse de fromage râpé,\n1 cuillère à café d'huile végétale ou un peu de beurre.",
    "instructions": "1. Faites chauffer une poêle plate ou une poêle antiadhésive à feu moyen.\n2. Graissez légèrement la poêle avec un peu d'huile ou de beurre.\n3. Placez une tortilla dans la poêle.\n4. Saupoudrez le fromage râpé uniformément sur toute la surface de la tortilla.\n5. Placez la deuxième tortilla sur le fromage, ou pliez la première tortilla en deux si vous utilisez une seule tortilla.\n6. Faites cuire 2-3 minutes par côté, ou jusqu'à ce que le fromage fonde et que la tortilla soit dorée et croustillante. Si elle est pliée, retournez-la et faites cuire l'autre côté.\n7. Retirez de la poêle, coupez en plusieurs morceaux (par exemple, des triangles).\n8. Servez chaud, éventuellement avec de la salsa ou du guacamole.",
    "imageUrl":"https://raw.githubusercontent.com/rovihan12/resep-kitchen/main/quesadillas_keju.jpg"
  },
  {
    "title": "Soupe de Tomates Simple (Europe)",
    "ingredients": "500 grammes de tomates fraîches (coupées en dés) ou 1 boîte de tomates concassées (environ 400g),\n1 oignon moyen (haché),\n2 gousses d'ail (finement hachées),\n2 tasses de bouillon de légumes,\n2 cuillères à soupe d'huile d'olive,\n1 cuillère à café de sucre (pour équilibrer l'acidité de la tomate),\nsel et poivre noir au goût,\ndes feuilles de basilic frais pour la garniture (facultatif).",
    "instructions": "1. Faites chauffer l'huile d'olive dans une casserole moyenne à feu moyen.\n2. Ajoutez l'oignon haché, faites-le revenir jusqu'à ce qu'il soit ramolli et translucide, environ 5-7 minutes.\n3. Ajoutez l'ail finement haché, faites-le revenir brièvement jusqu'à ce qu'il soit parfumé (environ 1 minute), ne le brûlez pas.\n4. Ajoutez les tomates coupées en dés (fraîches ou en conserve) dans la casserole. Mélangez bien.\n5. Versez le bouillon de légumes. Ajoutez le sucre, le sel et le poivre noir.\n6. Portez à ébullition, puis réduisez le feu et laissez mijoter doucement pendant 15-20 minutes pour que toutes les saveurs se mélangent.\n7. Si vous voulez une soupe plus lisse, mixez la soupe à l'aide d'un mixeur plongeant ou d'un mixeur classique jusqu'à obtenir la consistance désirée. Filtrez si vous ne voulez pas de graines ou de peaux de tomates.\n8. Servez la soupe de tomates chaude avec une pincée de feuilles de basilic frais (si utilisé) ou du pain grillé.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/main/sup_tomat.jpg"
  },
  {
    "title": "Shakshuka (Œufs Pochés du Moyen-Orient)",
    "ingredients": "2 œufs,\n1 cuillère à soupe d'huile d'olive,\n1/2 oignon haché,\n1 gousse d'ail hachée,\n1/2 poivron haché,\n2 tomates hachées (ou 1/2 tasse de tomates en conserve),\nsel et poivre au goût,\nune pincée de paprika en poudre ou de cumin (facultatif),\npersil frais (facultatif).",
    "instructions": "1. Faites chauffer l'huile d'olive dans une poêle à feu moyen.\n2. Faites revenir l'oignon et l'ail jusqu'à ce qu'ils soient tendres.\n3. Ajoutez le poivron, faites cuire jusqu'à ce qu'il soit tendre.\n4. Ajoutez les tomates, le paprika/cumin, le sel et le poivre. Faites cuire 5–7 minutes.\n5. Faites de petites indentations et cassez les œufs dedans.\n6. Couvrez et faites cuire jusqu'à ce que les œufs soient à votre goût.\n7. Saupoudrez de persil et servez avec du pain.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/refs/heads/main/Shakshuka.jpg"
  },
  {
    "title": "Roti aux Œufs (Roti Canai aux Œufs)",
    "ingredients": "1 feuille de roti canai ou paratha nature (surgelé, c'est bon),\n1 œuf,\n1 cuillère à soupe d'oignon haché,\nsel et poivre au goût,\nhuile ou beurre pour la friture.",
    "instructions": "1. Décongelez le pain si surgelé.\n2. Battez l'œuf avec l'oignon, le sel et le poivre.\n3. Faites chauffer un peu d'huile/beurre dans une poêle.\n4. Versez le mélange d'œufs et placez immédiatement le pain dessus.\n5. Faites cuire jusqu'à ce que l'œuf soit pris, puis retournez pour faire dorer l'autre côté.\n6. Servez chaud avec de la sauce chili ou du curry.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/refs/heads/main/Roti%20Telur.jpg"
  },
  {
    "title": "Pain Grillé Sucré (Pain Perdu)",
    "ingredients": "2 tranches de pain,\n1 œuf,\n1/4 tasse de lait,\n1 cuillère à café de sucre,\nune pincée de poudre de cannelle (facultatif),\nbeurre pour la friture,\nsirop ou sucre glace pour le service.",
    "instructions": "1. Battez l'œuf, le lait, le sucre et la cannelle.\n2. Trempez le pain dans le mélange, en vous assurant que les deux côtés sont recouverts.\n3. Faites fondre le beurre dans une poêle à feu moyen.\n4. Faites frire le pain jusqu'à ce qu'il soit doré des deux côtés.\n5. Servez chaud avec du sirop ou du sucre glace.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/refs/heads/main/French%20Toast.jpg"
  },
  {
    "title": "Tamagoyaki (Omelette Japonaise Roulée)",
    "ingredients": "3 œufs,\n1 cuillère à soupe de sucre,\n1 cuillère à café de sauce soja,\nune pincée de sel,\nhuile pour la cuisson.",
    "instructions": "1. Battez les œufs avec le sucre, la sauce soja et le sel jusqu'à ce que le tout soit bien combiné.\n2. Faites chauffer une poêle légèrement huilée à feu moyen.\n3. Versez une petite quantité de mélange d'œufs et faites cuire jusqu'à ce qu'il soit semi-ferme.\n4. Roulez l'œuf sur un côté.\n5. Ajoutez plus de pâte, en soulevant le rouleau pour que la nouvelle pâte coule dessous.\n6. Quand il est semi-ferme, roulez à nouveau.\n7. Répétez jusqu'à épuisement de toute la pâte.\n8. Coupez et servez chaud ou froid.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/refs/heads/main/Tamagoyaki.jpg"
  },
  {
    "title": "Riz Frit Simple",
    "ingredients": "2 assiettes de riz blanc cuit,\n2 gousses d'ail hachées,\n1 œuf,\n2 cuillères à soupe de sauce soja sucrée,\n1 cuillère à café de sauce aux huîtres (facultatif),\nsel et poivre au goût,\n2 cuillères à soupe d'huile pour sauter.",
    "instructions": "1. Faites chauffer l'huile et faites revenir l'ail jusqu'à ce qu'il soit parfumé.\n2. Ajoutez l'œuf, brouillez jusqu'à cuisson.\n3. Ajoutez le riz et mélangez bien.\n4. Ajoutez la sauce soja sucrée, la sauce aux huîtres, le sel et le poivre. Remuez jusqu'à ce que l'assaisonnement soit absorbé.\n5. Servez chaud avec vos garnitures préférées.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/main/Nasi%20Goreng.jpg"
  },
  {
    "title": "Onigiri (Boulette de Riz Japonaise)",
    "ingredients": "2 tasses de riz cuit,\n1 cuillère à café de sel,\n2 feuilles de nori (coupées à la taille),\nfarciture (thon mayo, saumon grillé ou umeboshi).",
    "instructions": "1. Mélangez le sel dans le riz chaud.\n2. Préparez la garniture.\n3. Prenez le riz sur un film plastique, ajoutez la garniture, puis enveloppez.\n4. Formez un triangle.\n5. Enveloppez avec du nori.\n6. Servez.",
    "imageUrl": "https://raw.githubusercontent.com/rovihan12/resep-kitchen/main/Onigiri.jpg"
  }
]
